{
  "education": [
    {
      "awards_achievements": [
        "Major Entrance Scholarship (2018)",
        "Dean's List (2020, 2023)",
        "President's List (2020)"
      ],
      "degree": "Bachelor of Science (Honours)",
      "department": "Computer Science",
      "duration": "2018-2023",
      "school_name": "Ontario Tech University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_TharuniIranjan",
  "highlighted_projects": [
    {
      "description": "A research study on the ability to automatically classify product features into positive and negative affiliations using a product review data set. The purpose of this project is to utilize customer reviews to allow companies to improve their products and subsequently increase customer purchasing. Natural Language Processing (NLP) techniques including sentiment analysis and text modelling was utilized to complete the task. Code was developed on Google Collab using Tensorflow and other Python libraries like scikit-learn and Pandas. Extensive research was completed on the campus library for approaches and best practices. Weekly meetings were held with my professor where we discussed progress, concerns and next steps, and a report was completed to summarize my findings.",
      "git_url": "https://github.com/TharuniI/ProdClass-ThesisProject",
      "name": "ProdClass - Machine Learning"
    },
    {
      "description": "This web application was developed during COVID-19 and was created with the intent of enhancing the online learning experience. Users can access this website through different account types and are shown their corresponding dashboard. This application was coded using JavaScript dynamically update content, alongside the frontend framework Vue.js to build the user interface. It builds on top of standard HTML, CSS, and JavaScript to easily build components like scale students use to rate the lecture, and the table for professors to view the student reactions to a lecture, and more. It also has Firebase support, which was used in the backend. Services used include: authentication, cloud functions like sending event-based email notifications, and Firestore for a real time database.",
      "git_url": "https://github.com/TharuniI/LearningLeaf/tree/main/majorgroupproject-nng-learning-leaf/majorgroupproject-nng-main",
      "name": "Learning Leaf - Full Stack Application"
    },
    {
      "description": "The purpose of this project was to design and develop a database for an IMDB like website. Initial research and requirements gathering was done to understand the flow of the application. Use case diagrams and ERD were created using LucidChart and Toad Data Modeler. At this stage, information like what tables were needed, what the primary keys are, what columns each table contained, how each table is connected were established. PostgresSQL’s pgAdmin was used to create the table, add values, and query for certain information requested by the customer.",
      "name": "IMDB Emulator - Database Development"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This project aims to assist the Jarvis Linux Cluster Administration (LCA) team in managing a Linux cluster of 10 nodes running CentOS 7. Users can write SQL queries to extract real-time resource usage data, facilitating future resource planning. The project includes a psql instance for data persistence, a bash_agent with scripts for data collection, and Docker for database provisioning. The source code is managed on GitHub, and cron is used for scheduling the agent scripts.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_TharuniIranjan/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: The purpose of this project was to create a stock market simulator which allows an individual to view daily updates on particular stocks and buy or sell their shares at market price. It is to help people who want to invest but want to trial run with fake money to start off. Users are asked to enter a request type like view, buy or sell, and changes are made to the database accordingly. Java was used to develop this application with Maven as the build tool. Alpha Vantage API from RapidAPI was accessed using a GET request to access real-time stock information. JDBC was used to view/modify data in PostgreSQL. Testing was completed using Junit and Mockito.",
        "Grep App: This Java application is an implementation of a grep tool, which searches for lines within files that match a specified regular expression pattern. The application accepts three command-line arguments. The regular expression to search for, the root directory path where the search should begin, and the output file path where the matched lines will be written. Maven was used to build the Java project, Docker was used to containerize the application, and GitHub for source code management."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_TharuniIranjan/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "This project builds on the JDBC stock market application, with additional features. This Java application manages clients and their accounts, executes security orders, and provides real-time market data The application leverages various technologies including Spring boot for application configuration, Logger to log information, Maven to build the project, Junit and Mockito for testing, Docker for containerization, PostgreSQL for data persistence, and IEX Cloud for real-time market data.  Software follows the Model-view-controller design pattern.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_TharuniIranjan/springboot",
      "name": "Springboot App"
    }
  ],
  "name": "Tharuni Iranjan",
  "others": [
    {
      "bullets": [
        "Career Essentials in Software Development by Microsoft and LinkedIn  (2023)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Board games: I love playing strategic-style board games with my friends. Some popular ones we are currently playing are Codenames, Coup, and Here to Slay",
        "Home Improvement: I started by painting my house, but now I've done some roofing and sub flooring work. I love watching home improvement shows like Property Brothers, and hope to do more work around my house!"
      ],
      "title": "Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "I managed databases using SQL to ensure organized data storage and efficient manipulation, completing CRUD operations for smooth data retrieval. Employing Bash scripting, I automated routine tasks like system maintenance, enhancing overall workflow efficiency. Additionally, I developed Java applications collaboratively to improve firm-wide processes, including secure text-based searching of company documents, and conducted thorough data analytics using Python with libraries like Pandas, NumPy, and Matplotlib to inform strategic decision-making based on market trends.",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Osler, Hoskin, and Harcourt LLP",
      "description": "In this role, I automated data transfer processes using PowerShell scripts, optimizing system performance and ensuring efficient task completion through rigorous testing and documentation. I efficiently managed cross-departmental requests, delivering customized Excel reports promptly by leveraging SQL queries and adapting to evolving needs. Additionally, I provided crucial technical support by proactively monitoring system alerts, conducting thorough root cause analyses, and documenting findings to enhance software functionality and resolve issues, contributing to the smooth operation of the Information Service department.",
      "duration": "2022",
      "title": "Applications Analyst"
    },
    {
      "company": "City of Brampton",
      "description": "In my position as a Data Analyst, I employed advanced statistical methods to analyze data from 100 companies, uncovering trends crucial for informed decision-making in building inspections, thereby enhancing customer satisfaction. Additionally, I leveraged R programming to create intuitive data visualizations of customer data, ultimately improving operational efficiency.",
      "duration": "2022",
      "title": "Data Analyst"
    },
    {
      "company": "Ontario Tech University",
      "description": "As a teaching assistant, I designed and executed engaging lesson plans for software development labs, fostering a deeper understanding of key OOP concepts among a class of 20 students through diverse instructional methods. During office hours, I demonstrated adept debugging skills by guiding students through problem-solving processes, improving the quality of their work and promoting independent learning. Additionally, I contributed to team meetings by implementing standardized evaluation practices, offering constructive feedback to enhance the overall student learning experience, and efficiently managing grading and feedback.",
      "duration": "2021",
      "title": "Teaching Assistant"
    }
  ],
  "skills": {
    "competent": [
      "Java",
      "C++",
      "JavaScript",
      "REST APIs",
      "Vue.js"
    ],
    "familiar": [
      "Kotlin",
      "TensorFlow",
      "R",
      "Docker",
      "Google Cloud Platform"
    ],
    "proficient": [
      "Python",
      "SQL",
      "Git",
      "Linux/Bash",
      "Agile/Scrum"
    ]
  },
  "summary": "I am a software developer with a Bachelors degree in Computer Science. During my undergraduate degree I have taken many courses like Full Stack Web Development, Machine Learning, Database Systems and Concepts, Software Quality Assurance and more where I was able to gain valuable knowledge of the software development life cycle, object-oriented programming in Python and more. My work experiences at Jarvis, Osler and the City of Brampton honed my skills in Java, SQL, and Bash. I was responsible for database management and software development, where I streamlined current processes and uncovered data insights. My exposure to an agile work environment has also equipped me with the ability to effectively manage my time and communicate and collaborate with team members. Overall, these experiences have piqued my interest in the world of data, and the importance of data management and pipelining. I am looking for a role where I can grow and challenge myself, and hope to make an impact on people’s daily lives."
}
